{"eps":[{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-022-thecrawlingeye","title":"The Crawling Eye","epNumber":"Episode 22","season":"1","description":"In the first episode to air on The Comedy Channel (aka Comedy Central), the crew watches a journalist and a UN troubleshooter team up to investigate a Swiss village under attack by one-eye tentacled monsters from outer space, in \"The Crawling Eye\" (1958). Meanwhile, on the SOL, Joel treats the bots to RAM chips, and on Deep 13, Dr. Forrester injects Dr. Erhardt with an antiperspirant for dogs."},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-023-therobotvstheaztecmummy","title":"The Robot vs. the Aztec Mummy","epNumber":"Episode 23","season":"1","description":"In the theater, the crew watches as a robot created by the evil Dr. Krupp attempts to defeat Popoca – the Aztec Mummy – and loot the treasure of his crypt, in \"The Robot vs the Aztec Mummy\" (1964). Meanwhile, on the SOL, Demon Dogs invade the SOL and cause chaos. This episode features the short riff \"Radar Men from the Moon, Chapter 1: Moon Rocket.\""},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-024-themadmonster","title":"The Mad Monster","epNumber":"Episode 24","season":"1","description":"In the theater, the crew watches as a mad scientist transforms his assistant into a werewolf, whom he sics on all those who mocked him, in \"Mad Monster\" (1942). Meanwhile, on the SOL, Joel swaps Crow and Servo's heads. This episode features the short \"Radar Men from the Moon, Chapter Two: Molten Terror.\""},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-025-womenoftheprehistoricplanet","title":"Women of the Prehistoric Planet","epNumber":"Episode 25","season":"1","description":"In the theater, the crew watches a search for survivors of a crash on a prehistoric planet inhabitated by giant iguanas, in \"Women of the Prehistoric Planet\" (1966). Meanwhile, on the SOL, Joel and the bots struggle to disarm a Doomsday Device. This episode features the song \"Flesh Barn\" jingle, the first original song aired from the seires. This film is the origin of the often-repeated riff \"Hi-Keeba!\""},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-026-thecorpsevanishes","title":"The Corpse Vanishes","epNumber":"Episode 26","season":"1","description":"In the theater, the crew watches as a botanist poisons brides at the altar, concocting a youth potion from their glands for his ancient wife, in \"The Corpse Vanishes\" (1942). Meanwhile, on the SOL, the crew unwinds with a game of tag and Crow runs a babershop. This epsidoe features the short \"Radar Men from the Moon, Chapter Three: Bridge of Death.\""},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-027-thecrawlinghand","title":"The Crawling Hand","epNumber":"Episode 27","season":"1","description":"In the theater, the crew watches as a naive medical student becomes a killer after he is possessed by the disembodied hand of an irradiated astronaut, in \"The Crawling Hand\" (1963). Meanwhile, on the SOL, Joel and the bots unleash their William Shatner impressions."},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-028-robotmonster","title":"Robot Monster","epNumber":"Episode 28","season":"1","description":"In the theater, the crew watches as the Earth's last survivors are hunted by an alien robot that resembles a gorilla in a diving helmet, in \"Robot Monster\" (1953). Meanwhile, in Deep 13, the Mads unveil their Flaming Whoopie Cushion. This episode features the shorts \"Radar Men from the Moon, Chapter Four: Flight to Destruction\" and \"Radar Men from the Moon, Chapter Five: Murder Car.\""},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-029-theslimepeople","title":"The Slime People","epNumber":"Episode 29","season":"1","description":"In the theater, the crew watch as a sportscaster/pilot leads a counter-attack on the subterranean reptile beasts that have conquered the city of Los Angeles, in \"The Slime People\" (1962).  Meanwhile, on the SOL, annoyed by the short, Crow and Servo take Commander Cody to \"Reality Court.\" This episode features the short \"Radar Men from the Moon, Chapter Six: Hills of Death.\""},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-030-projectmoonbase","title":"Project Moonbase","epNumber":"Episode 30","season":"1","description":"In the theater, the crew watches as a communist spy tries to sabotage an American space mission to the moon in the distant future (AKA 1970), in \"Project Moonbase\" (1953). Meanwhile, on the SOL, the Bots rattle off the many uses of the miracle home product SPACOM! This episode features the short \"Radar Men from the Moon, Chapter Seven: Camouflaged Destruction\" and \"Chapter Eight: The Enemy Planet.\""},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-031-robotholocaust","title":"Robot Holocaust","epNumber":"Episode 31","season":"1","description":"In the theater, the crew watches as a renegade group attempt to overthrow the Dark One and his minions and free mankind in a post-apocalytpic future in \"Robot Holocaust\" (1987). Meanwhile, on the SOL, Cambot's sitcom simulator laugh track goes haywire. This episode features the short \"Radar Men from the Moon, Chapter Nine: Battle in the Stratosphere.\""},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-032-moonzerotwo","title":"Moon Zero Two","epNumber":"Episode 32","season":"1","description":"In the theater, the crew watches as a former astronaut operates a cargo hauling business on the moon in \"Moon Zero Two\" (1969). Meanwhile, on the SOL, Crow and Servo battle in zero gravity."},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-033-untamedyouth","title":"Untamed Youth","epNumber":"Episode 33","season":"1","description":"In the theater, the crew watches as a pair of hitchhiking sisters are sentenced to work in a labor camp run by a corrupt local government in \"Untamed Youth\" (1957). Meanwhile, on the SOL, Gypsy is coughing up all sorts of exciting surprises."},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-034-theblackscorpion","title":"The Black Scorpion","epNumber":"Episode 34","season":"1","description":"In the theater, the crew watches as a a volcanic eruption causes giant scorpions to rage through Mexico in \"The Black Scorpion\" (1957). Meanwhile on the SOL, Joel and the bots pay tribute to Mexico in Spanish with less-than-helpful subtitles. This episode features Josh Weinstein's final eppearance as Dr. Laurence Erhardt and Tom Servo."},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-036-the-sidehackers","title":"The Sidehackers","epNumber":"Episode 36","season":"2","description":"In the theater, the crew watches as a motorcycle racer seeks vengence on the racer who murdered his fiancée in \"The Sidehackers\" (1969). Meanwhile, on the SOL, Joel and the bots provide their own commentary for the film's exciting new sport. This episode features the songs \"Sidehackin'\" and \"Only Love Pads the Film.\" Michael J. Nelson makes an appearance as the film's villain, J.C.."},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-037-junglegoddess","title":"Jungle Goddess","epNumber":"Episode 37","season":"2","description":"In the theater, the crew watches as a pair of pilots set out to find a missing woman and collect a reward, only to find her being worshipped by the jungle inhabitants in \"Jungle Goddess\" (1948). Meanwhile, on the SOL, Joel and the bots are threatened on the Hexfield Viewscreen by a pair of imperialistic aliens. This episode features the short \"The Phantom Creeps, Chapter One: The Menacing Power.\" Jim Mallon and Michael J. Nelson appear as the aliens."},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-038-catalinacaper","title":"Catalina Caper","epNumber":"Episode 38","season":"2","description":"In the theater, the crew watches as college kids enjoy 1960s-style beach shenanigans while they try to recover a stolen scroll in \"Catalina Caper\" (1967).  Meanwhile, in Deep 13, TV's Frank botches his Tupperware sales pitch. This episode features the song \"My Creepy Girl.\""},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-039-rocketattackusa","title":"Rocket Attack U.S.A.","epNumber":"Episode 39","season":"2","description":"In the theater, the crew watches as American spies in the USSR discover plans for an imminent missile assault, setting off an arms race in \"Rocket Attack USA\" (1958). Meanwhile on the SOL, Joel and the bots meet their Soviet counterparts. This episode features the short \"The Phantom Creeps, Chapter Two: Death Stalks the Highway.\""},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-040-ringofterror","title":"Ring Of Terror","epNumber":"Episode 40","season":"2","description":"In the theater, the crew watch as a medical student must perform a horrifying task as part of a fraternity initiation rite in \"Ring of Terror\" (1961). Meanwhile, on the SOL, Joel teaches the horrified bots about robot anatomy. This episode features the short T\"he Phantom Creeps, Chapter Three: Crashing Timbers\" and the song \"If Chauffeurs Ruled the World.\""},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-041-wildrebels","title":"Wild Rebels","epNumber":"Episode 41","season":"2","description":"In the theater, the crew watches as a retired stock-car racer goes undercover to infiltrate a biker gang of bank robbers in \"Wild Rebels\" (1967). Meanwhile, on the SOL, Gypsy finally gets recognition for all her talents."},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-042-lostcontinent","title":"Lost Continent","epNumber":"Episode 42","season":"2","description":"In the theater, the crew watches as a team of scientists and military men search for a missing rocket ship, and find a prehistoric island inhabited by a native woman and lots of dinosaurs, in \"Lost Continent\" (1951). Meanwhile, on the SOL, Crow and Servo refuse to back the White Male Reality."},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-043-thehellcats","title":"The Hellcats","epNumber":"Episode 43","season":"2","description":"In the theater, the crew watches as the fiancée and the brother of a murdered policeman infiltrate a gang of bikers in order to bring the killer to justice in \"The Hellcats\" (1967). Meanwhile, on the SOL, Joel and the Bots have flashbacks to previous experiments."},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-044-kingdinosaur","title":"King Dinosaur","epNumber":"Episode 44","season":"2","description":"In the theater, the crew watches as a group of astronauts explore a planet populated by giant lizards in \"King Dinosaur\" (1955). Meanwhile, on the SOL, Crow and Servo struggle to hype up Joey the Lemur. This episode features the short \"X Marks the Spot\" and the song \"Joey the Lemur.\""},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-045-firstspaceshiponvenus","title":"First Spaceship On Venus","epNumber":"Episode 45","season":"2","description":"In the theater, the crew watches as a team of multinational space explorers travel to Venus to investigate a alien artifact in \"First Spaceship on Venus\" (1960). Meanwhile, on the SOL, Joel struggles to recalibrate Servo's sarcasm sequencer. This episode features Michael J. Nelson as Abe Vigoda."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/cave-dwellers","title":"Cave Dwellers","epNumber":"Episode 48","season":"3","description":"In the theater, the crew watches as blonde barbarian called Ator fights to protect the mighty \"Geometric Nucleus\" from falling into the hands of a power-hungry villain in \"Cave Dwellers\" (1984). Meanwhile, on the SOL, Joel teaches the bots the art of Foley."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-049-gamera","title":"Gamera","epNumber":"Episode 49","season":"3","description":"In the theater, the crew watches as Japan comes under attack by Gamera, a giant, fire-breathing turtle monster, who also befriends a schoolboy in \"Gamera\" (1965). Meanwhile, on the SOL, Gamera pays a visit. This episode features the song \"Tibby, Oh Tibby.\" Michael J. Nelson appears as Gamera."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-050-podpeople","title":"Pod People","epNumber":"Episode 50","season":"3","description":"In the theater, the crew watches as a little kid befriends a magic alien he calls Trumpy, while Trumpy's alien family go on a murder spree in \"Pod People\" (1983). Meanwhile, on the SOL, Trumpy's magic is causing chaos. This episode features the songs \"Idiot Control Now\" and \"Clowns in the Sky.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-051-gamera-vs-barugon","title":"Gamera vs Barugon","epNumber":"Episode 51","season":"3","description":"In the theater, the crew watches as the legendary Gamera saves Earth from Barugon, a giant kaiju that hatches from a mysterious ruby egg in \"Gamera vs. Barugon\" (1966). Meanwhile, on the SOL, Joel and the bots present the 5000-piece Fightin' Men & Monster Set."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-052-strandedinspace","title":"Stranded In Space","epNumber":"Episode 52","season":"3","description":"In the theater, the crew watches as an astronaut finds himself on a parallel Earth with a dystopian government in “Stranded in Space” (1973). Meanwhile, on the SOL, Tom bakes cookies."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-053-timeoftheapes","title":"Time Of The Apes","epNumber":"Episode 53","season":"3","description":"In the theater, the crew watches as a woman and two children emerge from cryogenic capsules only to find themselves in a world populated by anthropomorphic apes in \"Time of the Apes\" (1987).  Meanwhile on the SOL, Crow deconstructs the fashions of the future. This episode features \"The Sandy Frank Song.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-054-daddyo","title":"Daddy-O","epNumber":"Episode 54","season":"3","description":"In the theater, the crew watches as a drag-racing singer investigates a murder and unwittingly becomes a courier for drug smugglers in \"Daddy-O\" (1958). Meanwhile, on the SOL, Joel and the bots re-enact some drag-racing. This epsidoe features the short \"Alphabet Antics\" and the song \"Hike Your Pants Up.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-055-gameravsgaos","title":"Gamera vs Gaos","epNumber":"Episode 55","season":"3","description":"In the theater, the crew watches as Gamera, The Friend to All Children, battles the pterosaur-like kaiju called Gaos, in \"Gamera vs. Gaos\" (1967). Meanwhile, on the SOL, Joel performs a plate-spinning act as Gaos the Great."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-057-fugitivealien","title":"Fugitive Alien","epNumber":"Episode 57","season":"3","description":"In the theater, the crew watches as an alien soldier defects to help Earth battle his former masters during an invasion in \"Fugitive Alien\" (1986). Meanwhile, on the SOL, Joel attempts to make sense of the plot using the Syd Field's Screenplay Model. This episode features the in-theater song \"He Tried to Kill Me with a Forklift.\" Michael J. Nelson appears as Jack Perkins."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-059-gameravsguiron","title":"Gamera vs Guiron","epNumber":"Episode 59","season":"3","description":"In the theater, the crew watches as Gamera battles the knife-headed kaiju called Guiron, and attempts to rescue two abducted schoolboys in \"Gamera vs Guiron\" (1969). Meanwhile, on the SOL, Crow ruins Joel's big magic trick. This episode features Joel and the bots' own version of the \"Gamera\" theme song, in English and in dubious Japanese."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-060-earthvsthespider","title":"Earth Vs. The Spider","epNumber":"Episode 60","season":"3","description":"In the theater, the crew watches as teenagers and a science teacher attempt to exterminate the giant spider that's rampaging through their small town in \"Earth vs. the Spider\" (1958). Meanwhile, on the SOL, there's a surprise performance from the rock group, Spidorr. This episode features the short \"Speech: Using Your Voice.\" Michael J. Nelson appears as the Custodian of the Seventh Galaxy."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-061-mightyjack","title":"Mighty Jack","epNumber":"Episode 61","season":"3","description":"In the theater, the crew watches as a secret organization with a flying submarine protect the world from the terrorist group \"Q\" in \"Mighty Jack\" (1968). Meanwhile, on the SOL, Crow and Servo fail to capture Joel in a prison of blinding light. This episode features the song \"Slow the Plot Down.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-062-teenagecaveman","title":"Teenage Caveman","epNumber":"Episode 62","season":"3","description":"In the theater, the crew watches as a teenage caveman sets out on a prehistoric Rumspringa, leaving his tribe to explore the jungle in \"Teenage Caveman\" (1958). Meanwhile, on the SOL, Joel and the bots examine the pendulum of human development. This episode features the shorts \"Aquatic Wizards\" and \"Catching Trouble.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-063-gameravszigra","title":"Gamera vs Zigra","epNumber":"Episode 63","season":"3","description":"In the theater, the crew watches as Gamera battles the shark-like alien monster Zigra, who wants to seize the Earth from mankind, in \"Gamera vs. Zigra\" (1971).  Meanwhile, on the SOL, Joel and the bots get a visit from Kenny and Helen, Gamera's young friends from the film. This episode features variations of the \"Gamera Theme Song.\" Michael J. Nelson appears as Kenny and Bridget Jones appears as Helen."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-064-vikingwomenandtheseaserpent","title":"Viking Women & the Sea Serpent","epNumber":"Episode 64","season":"3","description":"In the theater, the crew watches as Viking women in search of their missing husbands do battle with a society of barbarians, in “The Saga of the Viking Women and Their Voyage to the Waters of the Great Sea Serpent” (1957). Meanwhile, on the SOL, Joel has developed a worrying obsession with waffles. This episode features the short “The Home Economics Story.”"},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-065-starforcefugitivealienii","title":"Star Force - Fugitive Alien II","epNumber":"Episode 65","season":"3","description":"In the theater, the crew watches as the Fugutive Alien, Ken, returns to help the human crew of the Bacchus 3 destroy the devastating super-weapon of Ken's homeworld in \"Star Force: Fugitive Alien II\" (1987). Meanwhile, on the SOL, Joel and the bots present the Captain Joe action figure. This episode features the \"Fugitive Alien Medley.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-066-warofthecolossalbeast","title":"War of the Colossal Beast","epNumber":"Episode 66","season":"3","description":"In the theater, the crew watches as the military attempts to capture a fifty-foot soldier who is ravaging Mexico in \"War of the Colossal Beast\" (1958). Meanwhile, on the SOL, Joel and the bots get a visit from Glenn Manning, the Colossal Man himself. This epsidoe features the short \"Mr. B Natural.\" Michael J. Nelson appears as Glenn."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-067-theunearthly","title":"The Unearthly","epNumber":"Episode 67","season":"3","description":"In the theater, the crew watches as a mad scientist searches for a youth serum, and performs experiements on his patients in an isolated sanitorium in \"The Unearthly\" (1957). Meanwhile, on the SOL, Crow and Servo learn to appreciate Gypsy for all the little things she does around the ship. This episode features the shorts \"Posture Pals\" and \"Appreciating Our Parents.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-068-santaclausconquersthemartians","title":"Santa Claus Conquers The Martians","epNumber":"Episode 68","season":"3","description":"In the theater, the crew watches as a group of Martians, eager for their own Christmas back on Mars, abduct Santa and two children in \"Santa Claus Conquers the Martians\" (1964). Meanwhile, on the SOL, Joel and the bots share essays about Christmas. This episode features the song \"(Let's Have) A Patrick Swayze Christmas.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-069-masterninja","title":"Master Ninja","epNumber":"Episode 69","season":"3","description":"In the theater, the crew watch as an American ninja and his young sidekick protect local businesses from corrupt cops, thugs, and sleazy businessmen in \"Master Ninja I\" (1984). Meanwhile, on the SOL, Joel and the bots reveal the many alternatives to nunchucks. This episode features \"The Master Ninja Theme Song.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-070-thecastleoffumanchu","title":"The Castle Of Fu Manchu","epNumber":"Episode 70","season":"3","description":"In the theater, the crew watches as the wicked Doctor Fu Manchu uses an ocean-freezing chemical in an attempt to take over the world in \"The Castle of Fu Manchu\" (1969). Meanwhile, on the SOL, the film causes Joel and the bots to suffer emotional breakdowns."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-071-masterninjaii","title":"Master Ninja II","epNumber":"Episode 71","season":"3","description":"In the theater, the crew watches as an aging American ninja and his young sidekick do tyical ninja stuff: fighting terrorists and helping tuna cannery workers unionize in \"Master Ninja II\" (1984). Meanwhile, on the SOL, Tom assigns appropriate pets to a variety of crime-fighting characters."},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-073-thegiantgilamonster","title":"The Giant Gila Monster","epNumber":"Episode 73","season":"4","description":"In the theater, the crew watches as a thirty-foot lizard terrorizes a small town in Texas in \"The Giant Gila Monster\" (1959). Meanwhile, on the SOL, Servo dissects the \"leg up\" blocking technique used extensively in the movie."},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-074-citylimits","title":"City Limits","epNumber":"Episode 74","season":"4","description":"In the theater, the crew watches as gangs in a dystopian future attempt to take back control of their city from an evil corporation in \"City Limits\" (1985).  Meanwhile, on the SOL, Joel and the bots invent some new superheroes. This episode features the song \"Oh, Kim Cattrall!\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-075-teenagersfromouterspace","title":"Teenagers From Outer Space","epNumber":"Episode 75","season":"4","description":"In the theater, the crew watches as a teenage alien falls in love with a human girl and helps fight back against his former friends, who are attempting to take over the planet in \"Teenagers From Outer Space\" (1959). Meanwhile, on the SOL, Joel and the bots have an encounter with the disappointing crew of a Skull Cruiser."},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-076-beingfromanotherplanet","title":"Being From Another Planet","epNumber":"Episode 76","season":"4","description":"In the theater, the crew watches as an alien mummy awakens from suspended animation and terrorizes the campus in \"Being From Another Planet\" (1982).  Meanwhile, on the SOL, the bots try to scare Joel with their Haunted Boiler Room."},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-077-attackofthegiantleeches","title":"Attack of the Giant Leeches","epNumber":"Episode 77","season":"4","description":"In the theater, the crew watches as mutant leeches capture and drink the blood of people in a small Florida town in \"Attack of the Giant Leeches\" (1959). Meanwhile, on the SOL, Joel and the bots compare the movie to their own bizarre dreams. This episode features the short \"Undersea Kingdom, Chapter One: Beneath the Ocean Floor\" and the song \"A Danger to Myself and Others.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-078-thekillershrews","title":"The Killer Shrews","epNumber":"Episode 78","season":"4","description":"In the theater, the crew watches as the inhabitants of a tiny island are terrorized by genetically-altered, giant killer shrews (played by dogs in masks) in \"Killer Shrews\" (1959).  Meanwhile, on the SOL, Joel has a bad reaction to his Killer Shrew drink, as does TV's Frank down in Deep 13."},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-079-herculesunchained","title":"Hercules Unchained","epNumber":"Episode 79","season":"4","description":"In the theater, the crew watches as Hercules falls under an amnesia spell and becomes the prisoner/lover of the Queen Omphale in \"Hercules Unchained\" (1959). Meanwhile, in the SOL, the bots press Joel for answers about what Hercules and the queen are up to all day, alone together."},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-080-theindestructibleman","title":"The Indestructible Man","epNumber":"Episode 80","season":"4","description":"In the theater, the crew watches as a mad scientist brings an executed convict back to life; the convict is now out for revenge in \"Indestructible Man\" (1956).   Meanwhile, on the SOL, a parade goes terribly wrong. This episode features the short \"Undersea Kingdom, Chapter Two: The Undersea City.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-081-herculesagainstthemoonmen","title":"Hercules Against The Moon Men","epNumber":"Episode 81","season":"4","description":"In the theater, the crew watches as Hercules attempts to free a city from a queen who's under the control of a moon-worshiping cult in \"Herculese Against the Moon Men\" (1964). Meanwhile, in Deep 13, the Mads introduce the concept of DEEP HURTING. This episode features the song \"Pants!\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-082-themagicsword","title":"The Magic Sword","epNumber":"Episode 82","season":"4","description":"In the theater, the crew watches as a prince attempts to save a princess from a sorcerer who wants to feed her to his dragon in \"The Magic Sword\" (1962). Meanwhile, on the SOL, Joel ruins the bots' medieval pageant with his insistence on historical accuracy. This episode features the song \"Ode to Estelle.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-083-herculeandthecaptivewomen","title":"Hercules and the Captive Women","epNumber":"Episode 83","season":"4","description":"In the theater, the crew watches as Hercules journeys to Atlantis to rescue the King of Thebes in \"Hercules and the Captive Women\" (1961). Meanwhile, on the SOL, the bots engage in some good-natured brawling."},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-084-manhuntinspace","title":"Manhunt In Space","epNumber":"Episode 84","season":"4","description":"In the theater, the crew watches \"Manhunt in Space\" (1956) as Rocky Jones and his sidekick, Winky, battle evil space pirates, an evil space queen, and an evil space lieutenant. It's set in space.  Meanwhile, on the SOL, Joel and the bots get a visit from Winky via the Hexfield Viewscreen. This episode features the short \"General Hospital (Segment 1).\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-085-tormented","title":"Tormented","epNumber":"Episode 85","season":"4","description":"In the theater, the crew watches as a jazz pianist is haunted by the ghost of his mistress, putting a damper on his wedding plans in \"Tormented\" (1960). Meanwhile, on the SOL, Servo and Crow try haunting Joel and Gypsy."},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-086-thebeatniks","title":"The Beatniks","epNumber":"Episode 86","season":"4","description":"In the theater, the crew watches as a delinquent teen catches his big break as a singer, only to have his career threatened by his resentful former gang in \"The Beatniks\" (1960). Meanwhile, on the SOL, Joel and the bots explain how to spot a genuine beatnik. This episode features the short \"General Hospital (Segment 2).\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-088-crashofthemoons","title":"Crash Of The Moons","epNumber":"Episode 88","season":"4","description":"In the theater, the crew watches as Space Ranger Rocky Jones returns to rescue a planet that's on a collision course with a moon in \"Crash of the Moons\" (1954). Meanwhile, on the SOL, Joel and the bots do a read-through of Crow's spec script. This episode features the short \"General Hospital (Segment 3).\" Crow and Servo perform the song \"Gypsy Moons.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-090-therebelset","title":"The Rebel Set","epNumber":"Episode 90","season":"4","description":"In the theater, the crew watches as a coffeehouse regular hires three bumbling crooks to help him rob an armored car in \"The Rebel Set\" (1959). Meanwhile, on the SOL, Joel and the Bots keep busy with writing workshops and acting lessons. This episode features the short \"Johnny at the Fair.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-091-thehumanduplicators","title":"The Human Duplicators","epNumber":"Episode 91","season":"4","description":"In the theater, the crew watches as an alien takes over a lab on Earth to create android clones to infiltrate the government in \"The Human Duplicators\" . Meanwhile, on the SOL, Tom Servo decides to duplicate himself, but finds that his clones aren't blindly obedient like he'd hoped. This episode features Michael J. Nelson as Hugh Beaumont and Kevin Murphy as William Conrad."},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-092-monsteragogo","title":"Monster A-Go-Go","epNumber":"Episode 92","season":"4","description":"In the theater, the crew watches as a crash causes an astronaut to become an irradiated mutant creature, who then terrorizes a nearby town in \"Monster A-Go-Go\" (1965). Meanwhile, on the SOL, Gypsy doesn't understand Crow and Servo, and Crow and Servo don't understand the Piña Colada song. This episode features the short \"Circus on Ice.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-093-thedaytheearthfroze","title":"The Day The Earth Froze","epNumber":"Episode 93","season":"4","description":"In the theater, the crew watches as as a young man tries to rescue his best girl from a witch who's stolen a magic mill, in \"The Day the Earth Froze\" (1959), based on the Finnish fairytale, the Kalevala. Meanwhile, on the SOL, Joel and the bots discuss the nature of the mysterious \"Sampo.\" This episode features the short \"Here Comes the Circus.\" Gypsy perfoms the song \"Gypsy Rose Me.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-094-brideofthemonster","title":"Bride Of The Monster","epNumber":"Episode 94","season":"4","description":"In the theater, the crew watches as a mad scientist with a man-eating octopus turns folks into atomic superhuman monsters in \"Bride of the Monster\" (1955). Meanwhile, on the SOL, Cambot edits a better ending for the film. This episode features the short \"Hired! Part I.\" Joel and the bots perform \"Hired! The Musical.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-095-manosthehandsoffate","title":"Manos: The Hands of Fate","epNumber":"Episode 95","season":"4","description":"In the theater, the crew watches as a vacationing family find themselves in the lair of a demon-worshipping cultist, his harem of brides, and his minion, Torgo, in \"Manos: The Hands of Fate\" (1966). Meanwhile, in Deep 13, Torgo shows up very late with a pizza delivery. This episode features the short \"Hired! Part II.\" Michael J. Nelson makes an appearance as Torgo."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-096-warriorofthelostworld","title":"Warrior Of The Lost World","epNumber":"Episode 96","season":"5","description":"In the theater, the crew watches as a road warrior with a talking motocycle take on a fascist dictator in a dystopian future in \"Warrior of the Lost World\" (1984). Meanwhile, on the SOL, Joel and the bots discuss their own post-Apocalyptic plans."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-097-hercules","title":"Hercules","epNumber":"Episode 97","season":"5","description":"In the theater, the crew watches as Hercules and Jason search for the legendary Golden Fleece in \"Hercules\" (1958). Meanwhile, on the SOL, Joel and the bots get a visit from some Amazons via the Hexfield Viewscreen. This epsidoe features Bridget Jones as Amazon Mom Elaine and Mary Jo Pehl, in her first on-screen appearance, as Amazon Mom Carol."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-098-swampdiamonds","title":"Swamp Diamonds","epNumber":"Episode 98","season":"5","description":"In the theater, the crew watches as three women break out of jail and search for a hidden cache of stolen diamonds, emboldened by an undercover police officer, in \"Swamp Diamonds\" (1956). Meanwhile, on the SOL, Servo is inspired to ask one of his robot cohorts on a date. This episode also features the short riff, \"What to Do on a Date.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-099-secretagentsuperdragon","title":"Secret Agent Super Dragon","epNumber":"Episode 99","season":"5","description":"In the theater, the crew watches as a secret agent investigates a Venezuelan crime organization manufacturing a mind-altering chewing gum in \"Secret Agent Super Dragon\" (1966). Meanwhile, on the SOL, Joel and the bots do a read-through of Crow's wholesome screenplay, \"The Spy Who Hugged Me.\" This episode features the \"Secret Agent Super Dragon Theme Song.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-100-magicvoyageofsinbad","title":"Magic Voyage of Sinbad","epNumber":"Episode 100","season":"5","description":"In the theater, the crew watches as the Russisan folk hero Sadko (renamed Sinbad for this English dub) seeks the Bluebird of Happiness to bring back to his unhappy city in \"The Magic Voyage of Sinbad\" (1953). Meanwhile on the SOL, Servo leaves for his own Sinbad-like adventure."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-101-eegah","title":"Eegah","epNumber":"Episode 101","season":"5","description":"In this episode, the crew watches as a young woman and her singer boyfriend rescue her father from a giant caveman living in a California desert, in \"Eegah!\" (1962). Meanwhile, on the SOL, the bots alter Joel's face to resemble Arch Hall, Jr. This episode is the origin of the often-repeated line \"Watch out for snakes!\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-102-iaccusemyparents","title":"I Accuse My Parents","epNumber":"Episode 102","season":"5","description":"In the theater, the crew watches as a young man gets involved in a crime syndicate and ends up blaming his downfall on his inattentive parents in \"I Accuse My Parents\" (1944). Meanwhile, on the SOL, Gypsy helps to re-enact the nightclub scene in the movie. This episode features the short \"The Truck Farmer.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-103-operationkidbrother","title":"Operation Kid Brother","epNumber":"Episode 103","season":"5","description":"In the theater, the crew watches as a world-class plastic sugeon and lip-reader (played by Sean Connery's brother Neil) thwarts the plans of an evil crime syndicate in \"Operation Kid Brother\" (1967).  Meanwhile, on the SOL, Joel hypnotizes Crow, but has less success with Servo. This episode features Michael J. Nelson as Torgo."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-104-thegirlinloverslane","title":"The Girl In Lover's Lane","epNumber":"Episode 104","season":"5","description":"In the theater, the crew watches as a rich runaway named Danny and a vagrant named Bix Dugan get into trouble in a small town in \"The Girl in Lovers Lane\" (1959). Meanwhile, on the SOL, Servo and Crow, inspired by the film, try to instigate a fight with Joel. This episode features the train song \"What a Pleasant Journey.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-105-thepaintedhills","title":"The Painted Hills","epNumber":"Episode 105","season":"5","description":"In the theater, the crew watches as Lassie avenges her master's murder in an 1870s gold-mining town in \"The Painted Hills\" (1951). In the meantime, on the SOL, Crow is melted down into an ingot by Servo, but it turns out he's not actually made of gold. This episode features the short \"Body Care and Grooming.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-106-gunslinger","title":"Gunslinger","epNumber":"Episode 106","season":"5","description":"In the theater, the crew watches as the widow of a murdered sheriff steps up to fight outlaws in her rural town in \"Gunslinger\" (1956). Meanwhile, on the SOL, Servo sends Joel messages via the Gypsy Express."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-107-mitchell","title":"Mitchell","epNumber":"Episode 107","season":"5","description":"In the theater, the crew watches as a drunken oaf of a cop bumbles his way through a murder investigation in \"Mitchell\"  (1975). Meanwhile, on the SOL, Gypsy schemes to help Joel escape. This episode features Joel Hodgson's final regular appearance as Joel Robinson, and Michael J. Nelson's first appearance as Mike Nelson."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-108-thebrainthatwouldntdie","title":"The Brain That Wouldn't Die","epNumber":"Episode 108","season":"5","description":"In the theater, the crew watches as a scientist keeps his girlfriend's severed head alive in a pan while he tries to find her a new body, in \"The Brain That Wouldn't Die\" (1962). Meanwhile, on the SOL, Mike and the bots are visited by Jan in the Pan, the bodiless lady in the film. This episode features Mary Jo Pehl as Jan in the Pan."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-109-teenagestrangler","title":"Teen-Age Strangler","epNumber":"Episode 109","season":"5","description":"In the theater, the crew watches as a troubled teen is accused of murder when a serial killer terrorizes a small town in \"Teen-Age Strangler\" (1964). Meanwhile, on the SOL, the bots fit Mike with a modified pair of glasses that make him act like the teenage star of the film. This episode features the short \"Is This Love?\" and the song, \"I'm a Janitor.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-110-thewildworldofbatwoman","title":"The Wild World Of Batwoman","epNumber":"Episode 110","season":"5","description":"In the theater, the crew watches as a bat-costume-clad woman and her lady army battle an evil scientist bent on taking over the world in \"The Wild World of Batwoman\" (1966). Meanwhile, on the SOL, Mike, inspired by the short, insists the bots each write essays about cheating. This episode features the short \"Discussion Problems in Group Living: Cheating.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-111-alienfromla","title":"Alien from L.A.","epNumber":"Episode 111","season":"5","description":"In the theater, the crew watches as a squeaky-voiced Kathy Ireland attempts to rescue her imprisoned father from an underground Atlantis. On the SOL, Mike and the bots play an emotion guessing game. This episode features the song \"My Wild Irish Ireland"},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-112-beginningoftheend","title":"Beginning Of The End","epNumber":"Episode 112","season":"5","description":"In the theater, the crew watches as the military struggles to stop a rampaging horde of giant grasshoppers in \"The Beginning of the End\" (1957). Meanwhile, on the SOL, Servo performs a standup routine, but most of his jokes involve comparing grasshoppers to locusts."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-113-theatomicbrain","title":"The Atomic Brain","epNumber":"Episode 113","season":"5","description":"In the theater, the crew watches as an aging socialite lures young women to her mansion in an attempt to transplant her brain into one of their bodies in \"The Atomic Brain\" (1964). Meanwhile, on the SOL, the bots are unsettled by Mike's chin puppet demonstration. This episode features the short \"What About Juvenile Delinquency?\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-114-outlawofgor","title":"Outlaw (Of Gor)","epNumber":"Episode 114","season":"5","description":"In the theater, the crew watches as a college professor named Cabot returns to the magical planet Gor to battle a wicked queen and an evil sorcerer in \"Outlaw (Of Gor)\" (1989). Meanwhile, on the SOL, Mike and the bots do their best Jack Palance impressions as they read from the book \"Palance on Palance.\" This episode features the song \"Tubular Boobular Joy.\" It also won the 1993 Peabody Award for Outstanding Quality Programming."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-115-radarsecretservice","title":"Radar Secret Service","epNumber":"Episode 115","season":"5","description":"In the theater, the crew watches as the astonishing power of radar is used to track down criminals selling atomic gear on the black market in \"Radar Secret Service\" (1950). Meanwhile, on the SOL, the bots throw Mike a 10-year high school reunion based on information gathered from Mike's yearbook. This episode features the short \"Last Clear Chance.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-116-santaclaus","title":"Santa Claus","epNumber":"Episode 116","season":"5","description":"In the theater, the crew watches as Santa battles the demon Pitch for the soul of a little Mexican girl, Lupita, in \"Santa Claus\" (1959). Meanwhile, on the SOL, Mike is reunited with the Nelson family -- but unfortunately not HIS Nelson family -- via the Hexfield Viewfinder. This episode features the songs \"Whispering Christmas Warrior\" and \"Merry Christmas...If That's Okay.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-118-villageofthegiants","title":"Village Of The Giants","epNumber":"Episode 118","season":"5","description":"In the theater, the crew watches as a group of obnoxious teens take over a town after ingesting a growth formula, in \"Village of the Giants\" (1965). Meanwhile, in Deep 13, Dr. Clayton Forrester is preparing to replace TV's Frank with Torgo. This episode features the song \"The Greatest Frank of All.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-121-invasionusa","title":"Invasion USA","epNumber":"Episode 121","season":"6","description":"Description coming soon."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-122-thedeadtalkback","title":"The Dead Talk Back","epNumber":"Episode 122","season":"6","description":"In The Selling Wizard, an unseen narrator and a mute \"Pizza Dominatrix\" explain the benefits of freezer cases to grocery store owners. In The Dead Talk Back, a crackpot \"scientist\" invents the machine that can supposedly communicate with the dead and uses it to help solve a murder."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-123-zombienightmare","title":"Zombie Nightmare","epNumber":"Episode 123","season":"6","description":"In the theater, the crew watches as a beefy jock is raised from the dead and seeks revenge on his murderers in \"Zombie Nightmare\" (1987). Meanwhile, on the SOL, Mike ruins the bots' hot tub session."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-125-creepingterror","title":"Creeping Terror","epNumber":"Episode 125","season":"6","description":"In the theater, the crew watches as a blob-like creature terrorizes a quiet town in \"The Creeping Terror\" (1964). Meanwhile, on the SOL, Mike refuses to salute the flag Crow has designed."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-126-bloodlust","title":"Bloodlust!","epNumber":"Episode 126","season":"6","description":"In the theater, the crew watches as a a group of college kids are trapped on a private island and hunted by a madman in \"Bloodlust\" (1961). Meanwhile, on the SOL, Crow manages to ruin both a square dancing session and a murder mystery dinner theater. This episode features the short \"Uncle Jim's Dairy Farm.\" Mary Jo Pehl makes her first appearance as Pearl Forrester."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-127-codenamediamondhead","title":"Code Name: Diamond Head","epNumber":"Episode 127","season":"6","description":"In the theater, the crew watches as a secret agent in Hawaii goes undercover to keep an extinction-causing chemical from falling into enemy hands, in \"Code Name: Diamond Head\" (1977). Meanwhile, on the SOL, Magic Voice answers the bots' \"What if?\" questions. This episode features the short \"A Day at the Fair.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-128-theskydivers","title":"The Skydivers","epNumber":"Episode 128","season":"6","description":"In the theater, the crew watches as skydivers deal with the intense drama that comes with running a skydiving school in \"The Skydivers\" (1963). Meanwhile, on the SOL, shop class turns out to be a total bust. This episode features the short \"Why Study the Industrial Arts?\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-129-theviolentyears","title":"The Violent Years","epNumber":"Episode 129","season":"6","description":"In the theater, the crew watches as a girl gang goes on a crime spree under the leadership of a rebellious socialite in \"The Violent Years\" (1956). Meanwhile, in Deep 13, the Mads unveil their new radio station, \"Turn Your Crank to Frank!\" This episode features the short \"Young Man's Fancy.\" The Deep 13 and SOL crews perform their own theme songs, including \"Livin' in Deep 13.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-130-lastofthewildhorses","title":"Last Of The Wild Horses","epNumber":"Episode 130","season":"6","description":"In the theater, the crew watches as a rivalry between two ranches over a herd of wild horses ends in murder in \"Last of the Wild Horses\" (1948). Meanwhile, on the SOL, Mike and the bots meet their Mirror-Verse counterparts. This episode features a reprise of the song \"Joey the Lemur.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-131-thestarfighters","title":"The Starfighters","epNumber":"Episode 131","season":"6","description":"In the theater, the crew watches as a lot of airplanes are refueled mid-flight during a young Air Force pilot's training in \"The Starfighters\" (1964). Meanwhile, on the SOL, The United Servo Academy Men's Chorus stages a gripping performance. This episode features the song \"United Servo Academy Men's Chorus Hymn.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-132-thesinisterurge","title":"The Sinister Urge","epNumber":"Episode 132","season":"6","description":"In the theater, the crew watches as a cop tries to shut down a \"smut-picture racket\" that may be connected to a series of killings in \"The Sinister Urge\" (1960). Meanwhile, on the SOL, Mike and the bots must reluctantly figure out a way to save Dr. Forrester from being blown up by TV's Frank. This episode features the short \"Keeping Clean and Neat.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-135-racketgirls","title":"Racket Girls","epNumber":"Episode 135","season":"6","description":"In the theater, the crew watches as a gym owner uses a stable of female wrestlers as a front for a criminal organization in \"Racket Girls\" (1951). Meanwhile, on the SOL, Crow and Servo plan their wedding. This episode features the short \"Are You Ready for Marriage?\" Bridget Jones makes an appearance as Lisa Loeb, and Mary Jo Pehl returns as Jan-in-the-Pan."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-137-theswordandthedragon","title":"The Sword and the Dragon","epNumber":"Episode 137","season":"6","description":"In the theater, the crew watches as legendary Russian hero, Illya Morometz, battles the forces of an evil warlord with the help of a magic sword in \"The Sword and the Dragon\" (1956). Meanwhile, on the SOL, the Russian swordsman himself drops by on the Hexfield Viewscreen. This episode features appearances by Bridget Jones and Mary Jo Pehl as the Mads' neighbors from Deep 12."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-137-highschoolbigshot","title":"High School Big Shot","epNumber":"Episode 137","season":"6","description":"In the theater, the crew watches as an awkward teen gets mixed up in the wrong crowd and ends up a criminal in \"High School Big Shot\" (1959). Meanwhile, on the SOL, inspired by the short, Mike and the Bots introduce a line of specialty breads made with unconventional \"ingredients.\" This episode features the short Out of this World."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-138-redzonecuba","title":"Red Zone Cuba","epNumber":"Episode 138","season":"6","description":"In the theater, the crew watches as an escaped criminal joins in the Bay of Pigs invasion in \"Red Zone Cuba\" (1966).  Meanwhile, on the SOL, Mike believes he is Carol Channing. This episode features the short \"Speech: Platform Posture and Appearance,\" and also the \"Bouncy Upbeat Song.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-139-dangerdeathray","title":"Danger!! Death Ray","epNumber":"Episode 139","season":"6","description":"In the theater, the crew watches as secret agent Bart Fargo attempts to retreive a death ray from a criminal organization in \"Danger!! Death Ray\" (1967). Meanwhile, on the SOL, Cambot is heartbroken over all the security cameras blown up in the film."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-140-thebeastofyuccaflats","title":"The Beast Of Yucca Flats","epNumber":"Episode 140","season":"6","description":"In the theater, the crew watches as a scientist becomes a monster and rampages a rural desert community in \"The Beast of Yucca Flats\" (1961). Meanwhile, on the SOL, Crow petitions for film anti-preservation so that bad movies can deteriorate rapidly like they deserve.  This episode featues the shorts \"Money Talks!\" and \"Progress Island U.S.A.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-141-angelsrevenge","title":"Angels Revenge","epNumber":"Episode 141","season":"6","description":"In the theater, the crew watches as a squad of gorgeous female vigilantes take on a drug ring in \"Angels Revenge\" (1979). Meanwhile, on the SOL, Mike agrees that being sentenced to death by cannon is a fitting punishment for his Fonzie impersonation."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-142-amazingtransparentman","title":"Amazing Transparent Man","epNumber":"Episode 142","season":"6","description":"In the theater, the crew watches as a bank robber suffers side effects from the invisibility device he acquired from a mad scientist in \"The Amazing Transparent Man\" (1960).  Meanwhile, in Deep 13, TV's Frank is devastated that he's missed his chance to see \"Squanto: A Warrior's Tale.\" This episode features the short \"The Days of Our Years.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-143-samsonvsthevampirewomen","title":"Samson Vs. The Vampire Women","epNumber":"Episode 143","season":"6","description":"In the theater, the crew watches as famous Mexican wrestler Santo (re-dubbed \"Samson\") battles a cult of vampiresses in \"Samson vs. The Vampire Women\" (1962). Meanwhile, in Deep 13, TV's Frank is escorted into Second Banana Heaven by Torgo the White. This episode features the song \"Who Will I Kill?\" This is Frank Coniff's final regular appearance as TV's Frank."},{"link":"https://www.gizmoplex.com/mst3k/season:7/videos/mst3k-144-nightofthebloodbeast","title":"Night Of The Blood Beast","epNumber":"Episode 144","season":"7","description":"In the theater, the crew watches as an astronaut finds himself pregnant with alien embryos in \"Night of the Blood Beast\" (1958). Meanwhile, in Deep 13, Dr. Forrester is adjusting to his overbearing mother now living with him. This episode features the short \"Once Upon a Honeymoon.\""},{"link":"https://www.gizmoplex.com/mst3k/season:7/videos/mst3k-145-thebruteman","title":"The Brute Man","epNumber":"Episode 145","season":"7","description":"In the theater, the crew watches as a blind woman unknowingly hosts a misshapen serial killer in her home in \"The Brute Man\" (1946). Meanwhile, on the SOL, Mike can't bear to have Servo gestating in an egg for 21 days. This episode features the short \"The Chicken of Tomorrow.\""},{"link":"https://www.gizmoplex.com/mst3k/season:7/videos/mst3k-146-deathstalkerandthewarriorsfromhell","title":"Deathstalker and the Warriors From Hell","epNumber":"Episode 146","season":"7","description":"In the theater, the crew watches as an acerbic hero adventures through the realm of Southland on a quest for three magic stones in \"Deathstalker and the Warriors From Hell\" (1988).  Meanwhile, on the SOL, Mike is enchanted by the Renaissance Fest the bots put on for him."},{"link":"https://www.gizmoplex.com/mst3k/season:7/videos/escape-2000","title":"Escape 2000","epNumber":"Episode 148","season":"7","description":"In the theater, the crew watches as a street punk protects the Bronx from being razed by an evil corporation in \"Escape 2000\" (1985). Meanwhile, on the SOL, Crow accidentally lights several fires and Mike chokes Servo with cigar smoke."},{"link":"https://www.gizmoplex.com/mst3k/season:7/videos/mst3k-149-laserblast","title":"Laserblast","epNumber":"Episode 149","season":"7","description":"\"In the theater, the crew watches as a disaffected teen with a cool van discovers an alien weapon in the desert, and is driven to go on a killing spree in \"\"Laserblast\"\" (1978). Meanwhile, in Deep 13, Dr. Forrester’s funding has been cut, so he’s cutting the satellite loose. This episode features Trace Beaulieu’s final appearance as both Dr. Clayton Forrester and Crow T. Robot. \""},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-155-theundead","title":"The Undead","epNumber":"Episode 155","season":"8","description":"In the theater, the crew watches as a hypnotist sends a woman from the present back into the distant past in \"The Undead\" (1957).  Meanwhile, on the SOL, Servo's invitation to join the Observers doesn't go well."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-157-theshecreature","title":"The She-Creature","epNumber":"Episode 157","season":"8","description":"In the theater, the crew watches as a hypnotist's beautiful assistant is transformed into a primeval creature and sent out on a killing spree in \"The She-Creature\" (1956). Meanwhile, on the SOL, Mike creeps everyone out with his custom Tickle-Me-Carlo-Lombari doll."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-159-thegiantspiderinvasion","title":"The Giant Spider Invasion","epNumber":"Episode 159","season":"8","description":"In the theater, the crew watches as hillbillies and scientists join forces to protect their town from a giant alien spider in \"The Giant Spider Invasion\" (1975). Meanwhile, on the SOL, Mike and the Bots fight off an infestation of mind-controlling alien pods."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-160-partstheclonushorror","title":"Parts: The Clonus Horror","epNumber":"Episode 160","season":"8","description":"In the theater, the crew watches as a young man discovers he and his friends only exist to be harvested for their \"spare parts\" in \"Parts: The Clonus Horror\" (1979). Meanwhile, the Mads are camping find themselves reluctantly babysitting a trio of all-powerful Space Children."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-161-theincrediblystrangecreatureswhostoppedlivingandbecamemixedupzombies","title":"The Incredibly Strange Creatures Who Stopped Living And Became Mixed-Up Zombies","epNumber":"Episode 161","season":"8","description":"In the theater, the crew watches as a carnival fortune teller turns men into mindless zombies to go out and kill for her in \"The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies\" (1964).  Meanwhile, on the SOL, Mike gets a new hairstyle from Shelli the Nanite."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-162-jackfrost","title":"Jack Frost","epNumber":"Episode 162","season":"8","description":"In the theater, the crew watches as a young man attempts to break a curse, and a young woman works for her wicked stepmother in \"Jack Frost\" (1964), based on the Russian fairytale Morozko. Meanwhile, on the SOL, Russian-American comic Yakov Smirnoff visits via the Hexfield Viewscreen."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-165-princeofspace","title":"Prince Of Space","epNumber":"Episode 165","season":"8","description":"In the theater, the crew watches as an alien superhero defends the earth from an invasion lead by the Phantom of Krankor in \"Prince of Space\" (1962). Meanwhile, on the SOL, Krankor pays a visit."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-166-thehorrorofpartybeach","title":"The Horror Of Party Beach","epNumber":"Episode 166","season":"8","description":"In the theater, the crew watches as mutant sea-creatures wreak havoc on local teens in \"The Horror of Party Beach\" (1964). Meanwhile, on the SOL, Servo irritates Mike with an updated to-the-second newspaper."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-167-devildoll","title":"Devil Doll","epNumber":"Episode 167","season":"8","description":"In the theater, the crew watches as a ventriloquist traps a human soul inside his dummy in \"Devil Doll\" (1964).  Meanwhile, on the SOL, Mike thinks that the demon called Pitch is a bad influence on Crow."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-168-invasionoftheneptunemen","title":"Invasion Of The Neptune Men","epNumber":"Episode 168","season":"8","description":"In the theater, the crew watches as the cosmic hero, Space Chief, defends the Earth from a Neptunion invasion in \"Invasion of the Neptune Men\" (1961). Meanwhile, on the SOL, a discussion of Noh Theater sparks a wacky conversation a la  Abbott and Costello."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-169-spacemutiny","title":"Space Mutiny","epNumber":"Episode 169","season":"8","description":"In the theater, the crew watches as a beefcake space pilot attempts to stop a mutiny on a ship with a giant boiler room in \"Space Mutiny\" (1988). Meanwhile, on the SOL, Crow is pretty sure he is a Bellerian."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-170-timechasers","title":"Time Chasers","epNumber":"Episode 170","season":"8","description":"In the theater, the crew watches as a physics teacher turns his light plane into a time machine and travels to the future to stop his future self from destroying the world.  Meanwhile, on the SOL, Crow messes with the timeline when he goes into the past."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/overdrawn-at-the-memory-bank","title":"Overdrawn At The Memory Bank","epNumber":"Episode 171","season":"8","description":"In the theater, the crew watches as a man living in a dystopian future unwittingly starts a revolution in \"Overdrawn at the Memory Bank\" (1983). Meanwhile, the Mads are hosting a pledge drive for Pearl. This episode features the song \"Loving Lovers Love.\""},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-173-thephantomplanet","title":"The Phantom Planet","epNumber":"Episode 173","season":"9","description":"In the theater, the crew watches as an astronaut is captured by the tiny alien inhabitants of a mysterious planet in \"The Phantom Planet\" (1961). Meanwhile, on the SOL, Mike and the Bots have a glass armonica recital."},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-174-thepumaman","title":"The Pumaman","epNumber":"Episode 174","season":"9","description":"In the theater, the crew watches as a college professor transforms into the legendary Aztec hero in \"The Pumaman\" (1980). Meanwhile, on the SOL, Mike becomes the mystical Coatimundi Man."},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-175-werewolf","title":"Werewolf","epNumber":"Episode 175","season":"9","description":"In the theater, the crew watches as a newly-discovered werewolf skeleton sets off a series of lyncanthropic murders in \"Werewolf\" (1996). Meanwhile, on the SOL, Mike and the bots share which celebrity relatives they'd cast in their own werewolf movies. This episode features the song \"Where, Oh Werewolf.\""},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-178-hobgoblins","title":"Hobgoblins","epNumber":"Episode 178","season":"9","description":"In the theater, the crew watches as a horde of murderous goblin-like creatures terrorize a group of teens in \"Hobgoblins\" (1988). Meanwhile, on the SOL, Crow presents his film \"Let's Talk Women!\""},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-179-thetouchofsatan","title":"The Touch Of Satan","epNumber":"Episode 179","season":"9","description":"In the theater, the crew watches as a young man stranded in a rural town finds out his new girlfriend is really an ancient witch in \"The Touch of Satan\" (1971). Meanwhile, on the SOL, Mike has taken up walnut farming."},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-180-gorgo","title":"Gorgo","epNumber":"Episode 180","season":"9","description":"In the theater, the crew watches as a Godzilla knockoff rampages in London in \"Gorgo\" (1961). Meanwhile, on the SOL, Mike and the Bots perform \"Waiting for Gorgo-t.\" This episode features a guest appearance by Leonard Maltin."},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-182-devilfish","title":"Devil Fish","epNumber":"Episode 182","season":"9","description":"In the theater, the crew watches as a prehistoric ocean creature terrorizes the Florida coast in \"Devil Fish\" (1984).  Meanwhile, on the SOL, dolphins attack from their highly-advanced spaceship."},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-183-thescreamingskull","title":"The Screaming Skull","epNumber":"Episode 183","season":"9","description":"In the theater, the crew watches as a new bride is tormented by a skull that may or may not be the ghost of her husband's first wife in \"The Screaming Skull\" (1958). Meanwhile, in the theater, Tom has metamorphasized into a beautiful butterfly. This episode features the short \"Gumby: Robot Rumpus.\""},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-184-questofthedeltaknights","title":"Quest Of The Delta Knights","epNumber":"Episode 184","season":"9","description":"In the theater, the crew watches as a young Leonardo da Vinci and friends set out on an adventure to find a cache of magical inventions in \"Quest of the Delta Knights\" (1993).  Meanwhile, on the SOL, the real Leonardo da Vinci stops by the SOL. This episode features Pearl Forrester riffing in the theater with the Bots."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-186-girlingoldboots","title":"Girl in Gold Boots","epNumber":"Episode 186","season":"10","description":"In the theater, the crew watches as a young woman travels to Los Angeles to become a go-go danceer and gets mixed up with the wrong crowd in \"Girl in Gold Boots\" (1969). Meanwhile, on the SOL, Crow dances in a tiny bikini. This episode features the song \"Oh, I am Sad.\""},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-187-merlinsshopofmysticalwonders","title":"Merlin's Shop Of Mystical Wonders","epNumber":"Episode 187","season":"10","description":"In the theater, the crew watches as Merlin sells a spellbook to a rude costumer and a wind-up monkey toy terrorizes a family in \"Merlin's Shop of Mystical Wonders\" (1996). Meanwhile, on the SOL, Mike and the bots are disturbed by Ernest Borgnine's series of unsettling children's books."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-188-futurewar","title":"Future War","epNumber":"Episode 188","season":"10","description":"In the theater, the crew watches as cyborgs and tiny dinosaurs hunt down an escaped slave in a dystopian future in \"Future War\" (1997). Meanwhile, on the SOL, Tom Servo challenges Gypsy to a kickboxing match."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-189-bloodwatersofdrz","title":"Blood Waters Of Dr. Z","epNumber":"Episode 189","season":"10","description":"In the theater, the crew watches as a mad scientist exacts revenge by transforming himself into a catfish and going on a killing spree in \"Blood Waters of Dr. Z\" (1971). Meanwhile, on the SOL, Mike and the Bots decide to go fishing."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-190-boggycreekiiandthelegendcontinues","title":"Boggy Creek II: And The Legend Continues","epNumber":"Episode 190","season":"10","description":"In the theater, the crew watches as a college professor and his students attempt to find a Bigfoot-like beast in an Arkansas swamp in \"Boggy Creek: And The Legend Continues\" (1985). Meanwhile, down in Castle Forrester, Pearl hopes to attract tourists by fabricating a legend of the Monster of the Forrester Swamp. This episode features the song \"The Legend of Bobo Creek.\""},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-191-trackofthemoonbeast","title":"Track of the Moon Beast","epNumber":"Episode 191","season":"10","description":"In the theater, the crew watches as a moon rock transforms a young man into a reptilian creature with ambiguous connections to Native American mythology in \"Track of the Moon Beast\" (1976).  Meanwhile, on the SOL, Crow apologizes at length for a prank."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-192-finaljustice","title":"Final Justice","epNumber":"Episode 192","season":"10","description":"In the theater, the crew watches as a Texas sheriff heads to Malta to clumsily pursue a killer in \"Final Justice\" (1985). Meanwhile, on the SOL, Crow and Tom are cruel to poor Goosio, Friend to Maltese Children Everywhere."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-193-hamlet","title":"Hamlet","epNumber":"Episode 193","season":"10","description":"In the theater, the crew watches as a German television producation of Shakespeare's tragedy proves to be unbearably dull in \"Hamlet\" (1961). Meanwhile, on the SOL, Mike and the bots play \"Alas,  Poor Whom?\" trying to guess the deceased person based on a single bone from their body."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-194-itlivesbynight","title":"It Lives By Night","epNumber":"Episode 194","season":"10","description":"In the theater, the crew watches as a man bitten by a bat becomes a murderous bat-creature with werewolf rules, in “It Lives By Night” (1974). Meanwhile, on the SOL, Mike asks Tom and Crow for input on redecorating the satellite."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-195-horrorsofspiderisland","title":"Horrors Of Spider Island","epNumber":"Episode 195","season":"10","description":"In the theater, the crew watches as a female dance troupe find themselves stranded on an island of killer spiders in \"Horrors of Spider Island\" (1960). Meanwhile, on the SOL, the bots manage to snag Mike in their very obvious giant web."}],"wit":{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-068-santaclausconquersthemartians","title":"Santa Claus Conquers The Martians","epNumber":"Episode 68","season":"3","description":"In the theater, the crew watches as a group of Martians, eager for their own Christmas back on Mars, abduct Santa and two children in \"Santa Claus Conquers the Martians\" (1964). Meanwhile, on the SOL, Joel and the bots share essays about Christmas. This episode features the song \"(Let's Have) A Patrick Swayze Christmas.\""},"oldWits":[{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-084-manhuntinspace","title":"Manhunt In Space","epNumber":"Episode 84","season":"4","description":"In the theater, the crew watches \"Manhunt in Space\" (1956) as Rocky Jones and his sidekick, Winky, battle evil space pirates, an evil space queen, and an evil space lieutenant. It's set in space.  Meanwhile, on the SOL, Joel and the bots get a visit from Winky via the Hexfield Viewscreen. This episode features the short \"General Hospital (Segment 1).\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-066-warofthecolossalbeast","title":"War of the Colossal Beast","epNumber":"Episode 66","season":"3","description":"In the theater, the crew watches as the military attempts to capture a fifty-foot soldier who is ravaging Mexico in \"War of the Colossal Beast\" (1958). Meanwhile, on the SOL, Joel and the bots get a visit from Glenn Manning, the Colossal Man himself. This epsidoe features the short \"Mr. B Natural.\" Michael J. Nelson appears as Glenn."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-065-starforcefugitivealienii","title":"Star Force - Fugitive Alien II","epNumber":"Episode 65","season":"3","description":"In the theater, the crew watches as the Fugutive Alien, Ken, returns to help the human crew of the Bacchus 3 destroy the devastating super-weapon of Ken's homeworld in \"Star Force: Fugitive Alien II\" (1987). Meanwhile, on the SOL, Joel and the bots present the Captain Joe action figure. This episode features the \"Fugitive Alien Medley.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-113-theatomicbrain","title":"The Atomic Brain","epNumber":"Episode 113","season":"5","description":"In the theater, the crew watches as an aging socialite lures young women to her mansion in an attempt to transplant her brain into one of their bodies in \"The Atomic Brain\" (1964). Meanwhile, on the SOL, the bots are unsettled by Mike's chin puppet demonstration. This episode features the short \"What About Juvenile Delinquency?\""},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-192-finaljustice","title":"Final Justice","epNumber":"Episode 192","season":"10","description":"In the theater, the crew watches as a Texas sheriff heads to Malta to clumsily pursue a killer in \"Final Justice\" (1985). Meanwhile, on the SOL, Crow and Tom are cruel to poor Goosio, Friend to Maltese Children Everywhere."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-121-invasionusa","title":"Invasion USA","epNumber":"Episode 121","season":"6","description":"Description coming soon."},{"link":"https://www.gizmoplex.com/mst3k/season:1/videos/mst3k-023-therobotvstheaztecmummy","title":"The Robot vs. the Aztec Mummy","epNumber":"Episode 23","season":"1","description":"In the theater, the crew watches as a robot created by the evil Dr. Krupp attempts to defeat Popoca – the Aztec Mummy – and loot the treasure of his crypt, in \"The Robot vs the Aztec Mummy\" (1964). Meanwhile, on the SOL, Demon Dogs invade the SOL and cause chaos. This episode features the short riff \"Radar Men from the Moon, Chapter 1: Moon Rocket.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-049-gamera","title":"Gamera","epNumber":"Episode 49","season":"3","description":"In the theater, the crew watches as Japan comes under attack by Gamera, a giant, fire-breathing turtle monster, who also befriends a schoolboy in \"Gamera\" (1965). Meanwhile, on the SOL, Gamera pays a visit. This episode features the song \"Tibby, Oh Tibby.\" Michael J. Nelson appears as Gamera."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-132-thesinisterurge","title":"The Sinister Urge","epNumber":"Episode 132","season":"6","description":"In the theater, the crew watches as a cop tries to shut down a \"smut-picture racket\" that may be connected to a series of killings in \"The Sinister Urge\" (1960). Meanwhile, on the SOL, Mike and the bots must reluctantly figure out a way to save Dr. Forrester from being blown up by TV's Frank. This episode features the short \"Keeping Clean and Neat.\""},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-067-theunearthly","title":"The Unearthly","epNumber":"Episode 67","season":"3","description":"In the theater, the crew watches as a mad scientist searches for a youth serum, and performs experiements on his patients in an isolated sanitorium in \"The Unearthly\" (1957). Meanwhile, on the SOL, Crow and Servo learn to appreciate Gypsy for all the little things she does around the ship. This episode features the shorts \"Posture Pals\" and \"Appreciating Our Parents.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-081-herculesagainstthemoonmen","title":"Hercules Against The Moon Men","epNumber":"Episode 81","season":"4","description":"In the theater, the crew watches as Hercules attempts to free a city from a queen who's under the control of a moon-worshiping cult in \"Herculese Against the Moon Men\" (1964). Meanwhile, in Deep 13, the Mads introduce the concept of DEEP HURTING. This episode features the song \"Pants!\""},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-043-thehellcats","title":"The Hellcats","epNumber":"Episode 43","season":"2","description":"In the theater, the crew watches as the fiancée and the brother of a murdered policeman infiltrate a gang of bikers in order to bring the killer to justice in \"The Hellcats\" (1967). Meanwhile, on the SOL, Joel and the Bots have flashbacks to previous experiments."},{"link":"https://www.gizmoplex.com/mst3k/season:9/videos/mst3k-179-thetouchofsatan","title":"The Touch Of Satan","epNumber":"Episode 179","season":"9","description":"In the theater, the crew watches as a young man stranded in a rural town finds out his new girlfriend is really an ancient witch in \"The Touch of Satan\" (1971). Meanwhile, on the SOL, Mike has taken up walnut farming."},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-042-lostcontinent","title":"Lost Continent","epNumber":"Episode 42","season":"2","description":"In the theater, the crew watches as a team of scientists and military men search for a missing rocket ship, and find a prehistoric island inhabited by a native woman and lots of dinosaurs, in \"Lost Continent\" (1951). Meanwhile, on the SOL, Crow and Servo refuse to back the White Male Reality."},{"link":"https://www.gizmoplex.com/mst3k/season:2/videos/mst3k-039-rocketattackusa","title":"Rocket Attack U.S.A.","epNumber":"Episode 39","season":"2","description":"In the theater, the crew watches as American spies in the USSR discover plans for an imminent missile assault, setting off an arms race in \"Rocket Attack USA\" (1958). Meanwhile on the SOL, Joel and the bots meet their Soviet counterparts. This episode features the short \"The Phantom Creeps, Chapter Two: Death Stalks the Highway.\""},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-131-thestarfighters","title":"The Starfighters","epNumber":"Episode 131","season":"6","description":"In the theater, the crew watches as a lot of airplanes are refueled mid-flight during a young Air Force pilot's training in \"The Starfighters\" (1964). Meanwhile, on the SOL, The United Servo Academy Men's Chorus stages a gripping performance. This episode features the song \"United Servo Academy Men's Chorus Hymn.\""},{"link":"https://www.gizmoplex.com/mst3k/season:4/videos/mst3k-095-manosthehandsoffate","title":"Manos: The Hands of Fate","epNumber":"Episode 95","season":"4","description":"In the theater, the crew watches as a vacationing family find themselves in the lair of a demon-worshipping cultist, his harem of brides, and his minion, Torgo, in \"Manos: The Hands of Fate\" (1966). Meanwhile, in Deep 13, Torgo shows up very late with a pizza delivery. This episode features the short \"Hired! Part II.\" Michael J. Nelson makes an appearance as Torgo."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-051-gamera-vs-barugon","title":"Gamera vs Barugon","epNumber":"Episode 51","season":"3","description":"In the theater, the crew watches as the legendary Gamera saves Earth from Barugon, a giant kaiju that hatches from a mysterious ruby egg in \"Gamera vs. Barugon\" (1966). Meanwhile, on the SOL, Joel and the bots present the 5000-piece Fightin' Men & Monster Set."},{"link":"https://www.gizmoplex.com/mst3k/season:7/videos/escape-2000","title":"Escape 2000","epNumber":"Episode 148","season":"7","description":"In the theater, the crew watches as a street punk protects the Bronx from being razed by an evil corporation in \"Escape 2000\" (1985). Meanwhile, on the SOL, Crow accidentally lights several fires and Mike chokes Servo with cigar smoke."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-161-theincrediblystrangecreatureswhostoppedlivingandbecamemixedupzombies","title":"The Incredibly Strange Creatures Who Stopped Living And Became Mixed-Up Zombies","epNumber":"Episode 161","season":"8","description":"In the theater, the crew watches as a carnival fortune teller turns men into mindless zombies to go out and kill for her in \"The Incredibly Strange Creatures Who Stopped Living and Became Mixed-Up Zombies\" (1964).  Meanwhile, on the SOL, Mike gets a new hairstyle from Shelli the Nanite."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-187-merlinsshopofmysticalwonders","title":"Merlin's Shop Of Mystical Wonders","epNumber":"Episode 187","season":"10","description":"In the theater, the crew watches as Merlin sells a spellbook to a rude costumer and a wind-up monkey toy terrorizes a family in \"Merlin's Shop of Mystical Wonders\" (1996). Meanwhile, on the SOL, Mike and the bots are disturbed by Ernest Borgnine's series of unsettling children's books."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-059-gameravsguiron","title":"Gamera vs Guiron","epNumber":"Episode 59","season":"3","description":"In the theater, the crew watches as Gamera battles the knife-headed kaiju called Guiron, and attempts to rescue two abducted schoolboys in \"Gamera vs Guiron\" (1969). Meanwhile, on the SOL, Crow ruins Joel's big magic trick. This episode features Joel and the bots' own version of the \"Gamera\" theme song, in English and in dubious Japanese."},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-160-partstheclonushorror","title":"Parts: The Clonus Horror","epNumber":"Episode 160","season":"8","description":"In the theater, the crew watches as a young man discovers he and his friends only exist to be harvested for their \"spare parts\" in \"Parts: The Clonus Horror\" (1979). Meanwhile, the Mads are camping find themselves reluctantly babysitting a trio of all-powerful Space Children."},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-096-warriorofthelostworld","title":"Warrior Of The Lost World","epNumber":"Episode 96","season":"5","description":"In the theater, the crew watches as a road warrior with a talking motocycle take on a fascist dictator in a dystopian future in \"Warrior of the Lost World\" (1984). Meanwhile, on the SOL, Joel and the bots discuss their own post-Apocalyptic plans."},{"link":"https://www.gizmoplex.com/mst3k/season:10/videos/mst3k-186-girlingoldboots","title":"Girl in Gold Boots","epNumber":"Episode 186","season":"10","description":"In the theater, the crew watches as a young woman travels to Los Angeles to become a go-go danceer and gets mixed up with the wrong crowd in \"Girl in Gold Boots\" (1969). Meanwhile, on the SOL, Crow dances in a tiny bikini. This episode features the song \"Oh, I am Sad.\""},{"link":"https://www.gizmoplex.com/mst3k/season:8/videos/mst3k-155-theundead","title":"The Undead","epNumber":"Episode 155","season":"8","description":"In the theater, the crew watches as a hypnotist sends a woman from the present back into the distant past in \"The Undead\" (1957).  Meanwhile, on the SOL, Servo's invitation to join the Observers doesn't go well."},{"link":"https://www.gizmoplex.com/mst3k/season:6/videos/mst3k-138-redzonecuba","title":"Red Zone Cuba","epNumber":"Episode 138","season":"6","description":"In the theater, the crew watches as an escaped criminal joins in the Bay of Pigs invasion in \"Red Zone Cuba\" (1966).  Meanwhile, on the SOL, Mike believes he is Carol Channing. This episode features the short \"Speech: Platform Posture and Appearance,\" and also the \"Bouncy Upbeat Song.\""},{"link":"https://www.gizmoplex.com/mst3k/season:7/videos/mst3k-144-nightofthebloodbeast","title":"Night Of The Blood Beast","epNumber":"Episode 144","season":"7","description":"In the theater, the crew watches as an astronaut finds himself pregnant with alien embryos in \"Night of the Blood Beast\" (1958). Meanwhile, in Deep 13, Dr. Forrester is adjusting to his overbearing mother now living with him. This episode features the short \"Once Upon a Honeymoon.\""},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-111-alienfromla","title":"Alien from L.A.","epNumber":"Episode 111","season":"5","description":"In the theater, the crew watches as a squeaky-voiced Kathy Ireland attempts to rescue her imprisoned father from an underground Atlantis. On the SOL, Mike and the bots play an emotion guessing game. This episode features the song \"My Wild Irish Ireland"},{"link":"https://www.gizmoplex.com/mst3k/season:5/videos/mst3k-100-magicvoyageofsinbad","title":"Magic Voyage of Sinbad","epNumber":"Episode 100","season":"5","description":"In the theater, the crew watches as the Russisan folk hero Sadko (renamed Sinbad for this English dub) seeks the Bluebird of Happiness to bring back to his unhappy city in \"The Magic Voyage of Sinbad\" (1953). Meanwhile on the SOL, Servo leaves for his own Sinbad-like adventure."},{"link":"https://www.gizmoplex.com/mst3k/season:3/videos/mst3k-068-santaclausconquersthemartians","title":"Santa Claus Conquers The Martians","epNumber":"Episode 68","season":"3","description":"In the theater, the crew watches as a group of Martians, eager for their own Christmas back on Mars, abduct Santa and two children in \"Santa Claus Conquers the Martians\" (1964). Meanwhile, on the SOL, Joel and the bots share essays about Christmas. This episode features the song \"(Let's Have) A Patrick Swayze Christmas.\""}],"gatheredOn":"Fri, 24 Nov 2023 13:11:06 GMT"}